

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `wyoump`
--
CREATE DATABASE IF NOT EXISTS `wyoump` DEFAULT CHARACTER SET utf8 COLLATE utf8_unicode_ci;
USE `wyoump`;

-- --------------------------------------------------------

--
-- Структура таблицы `all_mps`
--

CREATE TABLE `all_mps` (
  `id` int(11) NOT NULL,
  `first_name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `last_name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `party` text COLLATE utf8_unicode_ci NOT NULL,
  `presence_percent` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `answers`
--

CREATE TABLE `answers` (
  `id` int(11) NOT NULL,
  `id_query` int(11) NOT NULL,
  `answer` int(11) NOT NULL,
  `user_id` varchar(10000) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `policy`
--

CREATE TABLE `policy` (
  `id` int(255) NOT NULL,
  `name` varchar(10000) COLLATE utf8_unicode_ci NOT NULL,
  `person_id` int(255) NOT NULL,
  `agreement` float NOT NULL,
  `voted` tinyint(1) NOT NULL,
  `number_of_votes` int(255) NOT NULL,
  `label` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `question`
--

CREATE TABLE `question` (
  `id` int(11) NOT NULL,
  `question` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `policy` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `policy_id` int(11) NOT NULL,
  `agreement` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `question`
--

INSERT INTO `question` (`id`, `question`, `policy`, `policy_id`, `agreement`) VALUES
(1, 'Українську землю не можна продавати', 'За продовження мораторію на продаж землі \n', 75, 1),
(2, 'Українці можуть вільно і на власний розсуд торгувати землею', 'За продовження мораторію на продаж землі \n', 75, -1),
(3, 'Потрібно оцінювати вплив діяльності підприємств на довкілля, і за потреби обмежувати її', 'За екологічну реформу', 73, 1),
(4, 'Робота підприємства важливіша за його вплив на довкілля', 'За екологічну реформу', 73, -1),
(5, 'Потрібно звільнити всіх суддів, які порушили закон', 'За звільнення суддів', 72, 1),
(6, 'Звільнення суддів - це політична розправа над ними', 'За звільнення суддів', 72, -1),
(7, 'Всі чиновники мають подавати електронні декларації і відповідати за брехню в деклараціях', 'За електронне декларування з 2016 року', 24, 1),
(8, 'Електронне декларування паралізує роботу державних органів та порушує приватність', 'За електронне декларування з 2016 року', 24, -1),
(9, 'Об’єднання територіальних громад та фінансова незалежність від центральної влади піде їм на користь', 'За децентралізацію влади', 66, 1),
(10, 'Децентралізація вигідна місцевим корупціонерам і тому тільки погіршить ситуацію в регіонах', 'За децентралізацію влади', 66, -1),
(11, 'Прозорість державних органів, закупівель та надання повноважень НАБУ дозволить подолати корупцію', 'За антикорупційну реформу', 58, 1),
(12, 'Корупцію в Україні не подолати, а антикорупціонери заробляють гроші на цьому', 'За антикорупційну реформу', 58, -1),
(13, 'З депутатів, яких підозрюють у злочинах, треба знімати недоторканність', 'За зняття недоторканності з окремих народних депутатів', 62, 1),
(14, 'Зняття депутатської недоторканності - це політичне переслідування', 'За зняття недоторканності з окремих народних депутатів', 62, -1),
(15, 'Музика українською мовою обов’язково має звучати на радіо', 'За квоти для української музики', 56, 1),
(16, 'Не потрібно створювати переваг для україномовної музики', 'За квоти для української музики', 56, -1),
(17, 'Суддів, які не пройдуть оцінювання, не зможуть пояснити походження своїх статків, треба звільняти', 'За судову реформу', 54, 1),
(18, 'Судді повинні зберігати недоторканність, зняти яку може тільки парламент', 'За судову реформу', 54, -1),
(19, 'Генеральний прокурор може не мати юридичної освіти', 'За Генпрокурора без юридичної освіти (Юрія Луценка)', 50, 1),
(20, 'Змінювати закон, аби призначити на найвищі посади лояльних людей - погана практика', 'За Генпрокурора без юридичної освіти (Юрія Луценка)', 50, -1),
(21, 'Армія під час війни повинна мати спеціальний закон про закупівлі', 'За реформу закупівель в ЗСУ', 44, 1),
(22, 'Закупівлі в армії повинні регулюватися загальними законами', 'За реформу закупівель в ЗСУ', 44, -1),
(23, 'Інформація про роботу парламенту має бути максимально відкрита та доступна', 'За відкритість та прозорість роботи парламенту', 42, 1),
(24, 'Парламент добре інформує про свою діяльність і не потрібно нічого змінювати', 'За відкритість та прозорість роботи парламенту', 42, -1),
(25, 'Парламент мав виконати всі вимоги ЄС для запровадження безвізового режиму', 'За законопроекти для безвізового режиму з ЄС', 34, 1),
(26, 'Шкоди від ухалених на вимогу ЄС законопроектів буде більше, ніж користі від безвізового режиму', 'За законопроекти для безвізового режиму з ЄС', 34, -1),
(27, 'Мешканці мають самі обирати управителів, які обслуговуватимуть їх будинки', 'За реформу житлово-комунального господарства', 28, 1),
(28, 'ЖРЕПи повинні продовжити рацювати, бо це найкраща форма управління', 'За реформу житлово-комунального господарства', 28, -1),
(29, 'Партія має право позбавляти мандату обраних депутатів', 'За посилений контроль партій над депутатами усіх рівнів', 26, 1),
(30, 'Депутата можуть відкликати тільки виборці', 'За посилений контроль партій над депутатами усіх рівнів', 26, -1),
(31, 'Закупівлі товарів і послуг за бюджетні гроші мають відбуватись онлайн і прозоро', 'За публічні закупівлі', 20, 1),
(32, 'Онлайн-закупівлі лише ускладнюють ведення бізнесу', 'За публічні закупівлі', 20, -1),
(33, 'Неможливість дискримінації за сексуальною орієнтацією має бути законодавчо закріплена', 'За протидію дискримінації', 22, 1),
(34, 'ЛГБТ-питання - це провокація і відволікання від справжніх проблем в країні', 'За протидію дискримінації', 22, -1),
(35, 'Я готовий фінансувати з податків діяльність політичних партій, аби вони були незалежними від великого бізнесу', 'За державне фінансування партій', 4, 1),
(36, 'Партії повинні фінансуватись з внесків членів і симпатиків, а не з податків громадян', 'За державне фінансування партій', 4, -1),
(37, 'Комуністичний режим - поза законом', 'За декомунізацію', 11, 1),
(38, 'СРСР - це частина нашого минулого, яке повинне залишатись в назвах вулиць, закладів, творах', 'За декомунізацію', 11, -1),
(39, 'Держслужбовці мають обиратися на конкурсній основі, отримувати хорошу зарплату та бути незалежними від політиків', 'За реформу державної служби', 13, 1),
(40, 'Держслужба була організована добре, потрібно було лише призначити чесних людей', 'За реформу державної служби', 13, -1),
(41, 'Вся інформація, яка є у влади, має бути доступною для людей та для програм', 'За відкриті дані', 12, 1),
(42, 'Якщо громадянин хоче інформацію - нехай пише запит і отримає відповідь', 'За відкриті дані', 12, -1),
(43, 'Телекомпанії повинні повідомляти про своїх кінцевих власників', 'За прозорість власності на ЗМІ', 3, 1),
(44, 'Немає різниці, хто володіє телеканалом', 'За прозорість власності на ЗМІ', 3, -1),
(45, 'Медичні заклади мають фінансуватися залежно від кількості пацієнтів', 'За медичну реформу', 65, 1),
(46, 'В медичних закладах України не потрібні зміни', 'За медичну реформу', 65, -1),
(47, 'Український бізнес не розвивався через завелику кількість державних перевірок', 'За економічну дерегуляцію', 38, 1),
(48, 'Державна регуляція не шкодить бізнесу, але запобігає зловживанням', 'За економічну дерегуляцію', 38, -1),
(49, 'Має існувати можливість звертатись до влади з пропозиціями, скаргами в електронній формі', 'За електронну демократію (петиції)', 8, 1),
(50, 'Електронні петиції лише створюють інформаційний мотлох', 'За електронну демократію (петиції)', 8, -1),
(51, 'Користувачі надрами мають надавати всю інформацію про свою діяльність', 'За реформу енергетичного сектору', 6, 1),
(52, 'Інформація про роботу, сплачені податки видобувних кампаній - комерційна таємниця', 'За реформу енергетичного сектору', 6, -1),
(53, 'Ввізне мито на електромобілі повинно бути скасовано', 'За електромобілі', 14, 1),
(54, 'Ввізне мито на електромобілі потрібне для поповнення бюджету та захисту вітчизняного виробника', 'За електромобілі', 14, -1),
(55, 'Держава повинна надавати пільги індустріальним паркам', 'За підтримку індустріальних парків', 74, 1),
(56, 'Індустріальні парки повинні працювати на рівних умовах з іншими', 'За підтримку індустріальних парків', 74, -1),
(57, 'Податок на купівлю вживаних авто повинен бути зменшений', 'За зменшення податку на купівлю вживаних автомобілів', 63, 1),
(58, 'Вживані автомобілі потрібно обкласти більшим податком', 'За зменшення податку на купівлю вживаних автомобілів', 63, -1),
(59, 'Українці повинні отримувати внутрішні біометричні паспорти', 'За внутрішні біометричні паспорти', 64, 1),
(60, 'Біометричні паспорти українцям не потрібні', 'За внутрішні біометричні паспорти', 64, -1),
(61, 'Держава повинна посилено контролювати інтернет-простір', 'За посилення заходів з кібербезпеки', 70, 1),
(62, 'Держава не повинна без рішення суду втручатись у роботу інтернет-провайдерів', 'За посилення заходів з кібербезпеки', 70, -1),
(63, 'Податкове навантаження на бізнес потрібно зменшити', 'За податкову реформу', 67, 1),
(64, 'Для того, щоб були надходження до бюджету, потрібно збільшити податки', 'За податкову реформу', 67, -1),
(65, 'Підприємцям, які працюють з закордонними партнерами, не потрібно укладати і реєструвати договорів', 'За підтримку фрілансу', 79, 1),
(66, 'Всі підприємці, які працюють з закордонними партнерами, мають укладати і реєструвати договори', 'За підтримку фрілансу', 79, -1),
(67, 'Укладені у електронній формі договори повинні мати ту саму силу, що й паперові', 'За легалізацію електронної комерції', 2, 1),
(68, 'Визнання юридичної сили електронних договорів суттєво збільшить можливості аферистів та зменшить права споживачів', 'За легалізацію електронної комерції', 2, -1),
(69, 'Створення Національного фонду досліджень допоможе ефективніше використовувати спрямовані на науку кошти', 'За реформу науки', 21, 1),
(70, 'Усі розмови про ефективне фінансування науки - лише прикриття для бюджетних урізань.', 'За реформу науки', 21, -1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `all_mps`
--
ALTER TABLE `all_mps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`);

--
-- Индексы таблицы `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `question`
--
ALTER TABLE `question`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `answers`
--
ALTER TABLE `answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=247;
--
-- AUTO_INCREMENT для таблицы `question`
--
ALTER TABLE `question`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=71;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
